<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    { // كيف ترى إسرائيل التدخل الروسي في أوكرانيا؟
        DB::table('posts')->insert([
            'title' => "كيف تتعامل الولايات المتحدة مع العمليات العسكرية الروسية في أوكرانيا؟",
            'slug' =>"كيف-تتعامل-الولايات-المتحدة-مع-العمليات-العسكرية-الروسية-في-أوكرانيا؟",
            'body' => "<p> فى عام 2005، قال الرئيس الروسى فلاديمير بوتين فى خطاب له أمام البرلمان إن انهيار الاتحاد السوفيتى كان أسوأ كارثة جيوسياسية فى القرن 
            العشرين. قبل ذلك بعام واحد، كانت سبع دول قد انضمت لحلف الناتو: بلغاريا واستونيا ولاتفيا وليتوانيا 
            ورومانيا وسلوفاكيا وسلوفينيا. وفى عام 2009، انضمت ألبانيا وكرواتيا. وفى عام 2017، انضمت الجبل الأسود. وأخيراً فى عام 2020، انضمت مقدونيا الشمالية.
             بهذا اكتمل انضمام كافة دول أوروبا الشرقية، وتبلور اتجاه واضح من الحلف لضم كلٍ من جورجيا وأوكرانيا، وهو ما تعارضة روسيا باعتبارهما المجال الحيوى لروسيا
             الاتحادية التى ورثت الاتحاد السوفيتى عملياً، وأحبطت الحرب فى جورجيا 2008 ضمها للحلف، وحالياً تشكل الحرب فى أوكرانيا العملية الرئيسية لإفشال هذا المشروع تماماً.
              </p>",
             'user_id' => 1,
             'approved' => true,
             'category_id' => 1,
             'created_at' =>'2023-05-05 05:08:00',
             'image_path' =>'politica.png'
        ]);

        DB::table('posts')->insert([
            'title' => "العمليات العسكرية الروسية في أوكرانيا؟",
            'slug' =>"العمليات-العسكرية-الروسية-في-أوكرانيا؟",
            'body' => "<p> نسمع من وقت إلى آخر بمطالبات لفصل الدين عن السياسة، 
            ويقابلها في الجانب الآخر دعاوى لعدم فصلهما، وتحول الجدل مع مرور الوقت إلى
             صراع لا يتوقف، ومزايدات لا تتراجع، ونمر بالفعل في أزمة ثقافية وأمنية،
             تتداخل فيها مختلف دوائر العنف والعنف المضاد في المجتمع العربي، فدعاة الحل 
            الإسلاموي يطالبون بتولي سلطة فقهية المرجعية العليا في سلطات بعض الدول،
             وآخرون يصارعون من أجل عزل دعاة الحل الديني خوفاً من استبدادهم بالأمر والرأي.
              </p>",
             'user_id' => 2,
             'approved' => true,
             'category_id' => 1,
             'created_at' =>'2023-07-05 05:08:00',
             'image_path' =>'politica.png'
        ]);

        DB::table('posts')->insert([
            'title' =>"علاقة الاقتصاد بحياة الناس ومدى بؤسهم",
            'slug' =>"?علاقة-الاقتصاد-بحياة-الناس-ومدى-بؤسهم",
            'body' => "<p>الوضع الاقتصادي وما يرتبط به من أخبار ومؤشرات كلية ليس محل اهتمام 
            للكثير من الناس. وهذه الظاهرة ليست مقتصرة
             على مصر، لكنها قد تكون أكثر حدة في مصر
             مقارنة بالدول الغربية. ولعل من أسباب ذلك هو 
            الصورة الذهنية التي تكونت في أذهان العوام عن 
            الاقتصاديين وعن استخدام الكثير منهم للغة معقدة
             في شرح الاقتصاد وكذلك استدلالهم بكمية
             هائلة من المؤشرات الاقتصادية المحيرة
             والتي قد تكون متضاربة في بعض الأحوال.
             بالإضافة لذلك، يختلف الاقتصاديون بين بعضهم 
            البعض في الكثير من القضايا الأساسية نظراً
             لإختلاف إنحيازتهم مما يحير عوام الناس. كما
             أن بعض الاقتصاديين قد يعمدون إلى توظيف المؤشرات
             الاقتصادية لخدمة أهداف سياسية سواء بتهوين خطورة 
            الوضع الاقتصادي لدعم النظام أو تهويله في حالة معارضة النظام.
              </p>",
             'user_id' => 3,
             'approved' => true,
             'category_id' => 2,
             'created_at' =>'2022-07-05 05:08:00',
             'image_path' =>'economic.png'
        ]);

        DB::table('posts')->insert([
            'title' => "مقالات في التاريخ المبكر لأصول الفقه",
            'slug' => "مقالات-في-التاريخ-المبكر-لأصول-الفقه",
            'body' => "<p>يضمّ هذا الكتاب مقالات ثلاثة في التاريخ المبكّر لأصول
             الفقه قبل الإمام الشافعي وفي عصره، وهو عصر بالغ الأثر في ما بعده،
             ولا سيما لدى الحنفية. حيث تتبّعت المقالة الأولى الاصطلاح الأصولي قبل 
            الشافعي من خلال خمسة مصطلحات أساسية، مع التعويل بالأساس على مصنفات
             الأئمّة أبي يوسف ومحمد بن الحسن ومالك بن أنس، وتتقاطع معها في
             ذلك المقالة الثانية، فتدرس ثلاثة مفاهيم أصولية في الحقبة المبكّرة كذلك.
            أما المقالة الثالثة فـتُبرز تأثير رسالة الشافعي في المناقشات المنهجية
             الأصولية، حيث جمعت آراء الفقيه الحنفي عيسى بن أبان، وبيّنت انتقاداته للشافعي وردوده
             عليه في بعض المسائل الأصولية، ومن ثَمَّ ينتهي الكاتب إلى أن الإمام الشافعي يُعَدُّ محاورًا
             رئيسًا إبَّان تشكيل أصول الفقه لدى المذاهب المختلفة، وليس مؤسسًا لمنهجية واحدة.
              </p>",
             'user_id' => 4,
             'approved' => true,
             'category_id' => 3,
             'created_at' =>'2022-08-05 05:08:00',
             'image_path' =>'Religious.png'
        ]);

        

    }
}
